"Реализуйте генератор докладов по цифровой экономике. Данные для генерации извлекаются из таблицы:"
import random

dataBase = [
    ("Коллеги,","парадигма цифровой экономики","открывает новые возможности для","дальнейшего углубления","знаний и компетенций."),
    ("В то же время,","контекст цифровой трансформации","выдвигает новые требования","бюджетного финансирования","непроверенных гипотез."),
    ("Однако,","диджитализация бизнес-процессов","несёт в себе риски","синергетического эффекта","волатильных активов."),
    ("Тем не менее,","прагматичный подход к цифровым платформам","расширяет горизонты","компрометации конфиденциальных","опасных экспериментов."),
    ("Следовательно,","совокупность сквозных технологий","заставляет искать варианты", "универсальной коммодитизации","государственно-частных партнёрств."),
    ("Соответственно,","программа прорывных исследований","не оставляет шанса для","несанкционированной кастомизации","цифровых следов граждан."),
    ("Вместе с тем,","ускорение блокчейн-транзакций","повышает вероятность","нормативного регулирования","нежелательных последствий."),
    ("С другой стороны,","экспоненциальный рост Big Data","обостряет проблему","практического применения","внезапных открытий.")
]

num = int(input("Введите количество предложений: "))

for i in range (num):
    print(dataBase[random.randint(0, 4)][0], dataBase[random.randint(0,4)][1], dataBase[random.randint(0,4)][2], dataBase[random.randint(0,4)][3], dataBase[random.randint(0,4)][4], end = " ")
    print(dataBase[random.randint(0, 4)][0], dataBase[random.randint(0, 4)][1], dataBase[random.randint(0, 4)][2], dataBase[random.randint(0, 4)][3], dataBase[random.randint(0, 4)][4], end = " ")
    print(dataBase[random.randint(0, 4)][0], dataBase[random.randint(0, 4)][1], dataBase[random.randint(0, 4)][2],dataBase[random.randint(0, 4)][3], dataBase[random.randint(0, 4)][4], end = "\n")